Revit 2027 API
HandRailType.SupportNumber Property
 The number of supports of the handrail.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int SupportNumber { get; set; }
Public Property SupportNumber As Integer
	Get
	Set
public:
property int SupportNumber {
	int get ();
	void set (int value);
}
member SupportNumber : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for supportNumber is negative.
InvalidOperationException |  When setting this property: The rail has no support or the support layout is not fixed number so the data being set is not applicable.
See Also
Reference
HandRailType Class
Autodesk.Revit.DB.Architecture Namespace